{
  "name": "RecurlyInvoice",
  "base": "PersistedModel",
  "resourceName": "invoices",
  "properties": {
    "terms_and_conditions": {
      "type": "string",
      "description": "Optional notes field. This will default to the Terms and Conditions text specified on the Invoice Settings page in your Recurly admin. Specify custom notes with this tag to add or override Terms and Conditions. Custom notes will stay with a subscription on all renewals."
    },
    "customer_notes": {
      "type": "string",
      "description": "Optional notes field. This will default to the Customer Notes text specified on the Invoice Settings page in your Recurly admin. Specify custom notes with this tag to add or override Customer Notes. Custom notes will stay with a subscription on all renewals."
    },
    "vat_reverse_charge_notes": {
      "type": "string",
      "description": "VAT Reverse Charge Notes only appear if you have EU VAT enabled or are using your own Avalara AvaTax account and the customer is in the EU, has a VAT number, and is in a different country than your own. This will default to the VAT Reverse Charge Notes text specified on the Tax Settings page in your Recurly admin, unless custom notes were created with the original subscription. Specify custom notes with this tag to add or override VAT Reverse Charge Notes. Custom notes will stay with a subscription on all renewals."
    },
    "collection_method": {
      "type": "string",
      "description": "Can be either 'automatic' or 'manual'. Defaults to 'automatic'."
    },
    "net_terms": {
      "type": "string",
      "description": "Integer representing the number of days after an invoice's creation that the invoice will become past due. If an invoice's net terms are set to '0', it is due 'On Receipt' and will become past due 24 hours after it’s created. If an invoice is due net 30, it will become past due at 31 days exactly. Defaults to '0'."
    },
    "po_number": {
      "type": "string",
      "description": "Optional notes field. Attach a PO number to the invoice."
    }
  }
}
